org/emacs/holymacs.org
#+TITLE: Holymacs
#+AUTHOR: MinasMazar
#+EMAIL: minasmazar@gmail.com
#+DATE: <2025-01-07 Tue>
#+STARTUP: show2levels
#+PROPERTY: header-args :tangle ~/.emacs.d.holymacs/init.el
#+SETUPFILE: ../../../templates/_header.org

* Package initialization

#+begin_src elisp
  (add-to-list 'load-path "~/.emacs.d/vendor/") ; that's your sandbox
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("elpa" . "https://elpa.gnu.org/packages/")
			   ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

  (require 'use-package)
  (require 'use-package-ensure)
  (setq use-package-always-ensure t
	package-enable-at-startup t)
  (package-initialize)
#+end_src

* Emacs configuration

#+begin_src elisp
  (use-package emacs
    :ensure nil
    :defer
    :hook ((after-init . toggle-frame-maximized))
    :custom
    (completion-auto-help nil)
    (custom-file "~/.emacs.d.holymacs/custom.el")
    :config
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (scroll-bar-mode -1)
    (repeat-mode 1)
    (fido-vertical-mode)

    ;; Helpers
    (defun minemacs-files-in-emacs-subdir (subdir)
      (message "Scan files in emacs subdir %s" subdir)
      (let ((scan-dir (concat user-emacs-directory (format "%s/" subdir "/"))))
	(message "Scan files in dir %s" scan-dir)
	(if (file-exists-p scan-dir)
	    (directory-files scan-dir t directory-files-no-dot-files-regexp))))

    ;; Modules
    (defun minemacs-modules-load ()
      "Load all modules '*.el' files in 'modules/' under the 'user-emacs-directory'"
      (interactive)
      ;; TODO: locate-dominating-file
      (let ((modules (minemacs-files-in-emacs-subdir "modules")))
	(if modules (mapcar (lambda (module)
			      (load  module 'noerror))
			    modules))))
    :bind
    ("s-k" . #'execute-extended-command)
    ("s-j" . #'switch-to-buffer)
    ("s-0" . #'delete-window)
    ("s-1" . #'delete-other-windows)
    ("s-2" . #'split-window-below)
    ("s-3" . #'split-window-right)
    ("<XF86AudioLowerVolume>" . #'pulseaudio-control-decrease-sink-volume)
    ("<XF86AudioRaiseVolume>" . #'pulseaudio-control-increase-sink-volume)
    ("<XF86AudioMute>" . #'pulseaudio-control-toggle-current-sink-mute))

  (if (file-exists-p custom-file) (load-file custom-file))
  (minemacs-modules-load)
#+end_src

* System

#+begin_src elisp
  (use-package dmenu)
  (use-package pulseaudio-control)
#+end_src

* Exwm

Useful links:

- [[https://github.com/emacs-exwm/exwm/wiki][User Guide]]

#+begin_src elisp
  (use-package hydra
    :bind
    ("s-j" . #'holymacs-mode/body)
    :config
    (defhydra holymacs-mode (:color amaranth)
      "Holymacs"
      ("n" #'tab-next "➡️" :color blue)
      ("p" #'tab-previous "⬅️" :color blue)
      ("N" #'tab-next "➡️*" :color red)
      ("P" #'tab-previous "⬅️*" :color red)
      ("s-n" nil "quit")
      ("RET" nil "quit")))
#+end_src

#+begin_src elisp
  (use-package exwm
    :init
    (start-process "dex" nil "dex" "-a" "-e" "i3")
    (start-process "power-manager" nil "xfce4-power-manager")
    (start-process "xfce-settings" nil "xfsettingsd")
    ;; (async-shell-command "dex -a -e i3" nil nil)
    :config
    (server-mode 1)
    (require 'exwm)
    (setq exwm-workspace-number 4)
    ;; Make class name the buffer name.
    (add-hook 'exwm-update-class-hook
	      (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
    ;; Global keybindings.
    (setq exwm-systemtray-height 30
	  exwm-input-global-keys
	  `(([?\s-k] . execute-extended-command)
	    ([?\s-m] . exwm-reset)
	    ([?\s-M] . exwm-input-release-keyboard)
	    ([?\s-]] . next-buffer)
	    ([?\s-[] . previous-buffer)
	    ([?\s-o] . other-window)
	    ([?\s-n] . holymacs-mode/body)))
    (exwm-enable)
    (require 'exwm-systemtray)
    (exwm-systemtray-mode 1))
#+end_src
