emacs/holymacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org52656c8">Package initialization</a></li>
<li><a href="#org8c018a5">Emacs configuration</a></li>
<li><a href="#orgb57825f">System</a></li>
<li><a href="#orgbfbe61f">Exwm</a></li>
</ul>
</div>
</div>

<div id="outline-container-org52656c8" class="outline-2">
<h2 id="org52656c8">Package initialization</h2>
<div class="outline-text-2" id="text-org52656c8">
<div class="org-src-container">
<pre class="src src-elisp">(add-to-list 'load-path "~/.emacs.d/vendor/") ; that's your sandbox
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

(require 'use-package)
(require 'use-package-ensure)
(setq use-package-always-ensure t
      package-enable-at-startup t)
(package-initialize)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c018a5" class="outline-2">
<h2 id="org8c018a5">Emacs configuration</h2>
<div class="outline-text-2" id="text-org8c018a5">
<div class="org-src-container">
<pre class="src src-elisp">(use-package emacs
  :ensure nil
  :defer
  :hook ((after-init . toggle-frame-maximized))
  :custom
  (completion-auto-help nil)
  (custom-file "~/.emacs.d.holymacs/custom.el")
  :config
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (repeat-mode 1)
  (fido-vertical-mode)

  ;; Helpers
  (defun minemacs-files-in-emacs-subdir (subdir)
    (message "Scan files in emacs subdir %s" subdir)
    (let ((scan-dir (concat user-emacs-directory (format "%s/" subdir "/"))))
      (message "Scan files in dir %s" scan-dir)
      (if (file-exists-p scan-dir)
          (directory-files scan-dir t directory-files-no-dot-files-regexp))))

  ;; Modules
  (defun minemacs-modules-load ()
    "Load all modules '*.el' files in 'modules/' under the 'user-emacs-directory'"
    (interactive)
    ;; TODO: locate-dominating-file
    (let ((modules (minemacs-files-in-emacs-subdir "modules")))
      (if modules (mapcar (lambda (module)
                            (load  module 'noerror))
                          modules))))
  :bind
  ("s-k" . #'execute-extended-command)
  ("s-j" . #'switch-to-buffer)
  ("s-0" . #'delete-window)
  ("s-1" . #'delete-other-windows)
  ("s-2" . #'split-window-below)
  ("s-3" . #'split-window-right)
  ("&lt;XF86AudioLowerVolume&gt;" . #'pulseaudio-control-decrease-sink-volume)
  ("&lt;XF86AudioRaiseVolume&gt;" . #'pulseaudio-control-increase-sink-volume)
  ("&lt;XF86AudioMute&gt;" . #'pulseaudio-control-toggle-current-sink-mute))

(if (file-exists-p custom-file) (load-file custom-file))
(minemacs-modules-load)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb57825f" class="outline-2">
<h2 id="orgb57825f">System</h2>
<div class="outline-text-2" id="text-orgb57825f">
<div class="org-src-container">
<pre class="src src-elisp">(use-package dmenu)
(use-package pulseaudio-control)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfbe61f" class="outline-2">
<h2 id="orgbfbe61f">Exwm</h2>
<div class="outline-text-2" id="text-orgbfbe61f">
<p>
Useful links:
</p>

<ul class="org-ul">
<li><a href="https://github.com/emacs-exwm/exwm/wiki">User Guide</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(use-package hydra
  :bind
  ("s-j" . #'holymacs-mode/body)
  :config
  (defhydra holymacs-mode (:color amaranth)
    "Holymacs"
    ("n" #'tab-next "➡️" :color blue)
    ("p" #'tab-previous "⬅️" :color blue)
    ("N" #'tab-next "➡️*" :color red)
    ("P" #'tab-previous "⬅️*" :color red)
    ("s-n" nil "quit")
    ("RET" nil "quit")))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(use-package exwm
  :init
  (start-process "dex" nil "dex" "-a" "-e" "i3")
  (start-process "power-manager" nil "xfce4-power-manager")
  (start-process "xfce-settings" nil "xfsettingsd")
  ;; (async-shell-command "dex -a -e i3" nil nil)
  :config
  (server-mode 1)
  (require 'exwm)
  (setq exwm-workspace-number 4)
  ;; Make class name the buffer name.
  (add-hook 'exwm-update-class-hook
            (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
  ;; Global keybindings.
  (setq exwm-systemtray-height 30
        exwm-input-global-keys
        `(([?\s-k] . execute-extended-command)
          ([?\s-m] . exwm-reset)
          ([?\s-M] . exwm-input-release-keyboard)
          ([?\s-]] . next-buffer)
          ([?\s-[] . previous-buffer)
          ([?\s-o] . other-window)
          ([?\s-n] . holymacs-mode/body)))
  (exwm-enable)
  (require 'exwm-systemtray)
  (exwm-systemtray-mode 1))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-01-07 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
